apache/nuttx/arch/arm/src/imxrt/imxrt_usdhc.c
  uint32_t dsaddr;               /* DMA System Address Register */
  uint32_t blkattr;              /* Block Attributes Register */
  uint32_t cmdarg;               /* Command Argument Register */
  uint32_t xferty;               /* Transfer Type Register */
  uint32_t cmdrsp0;              /* Command Response 0 */
  uint32_t cmdrsp1;              /* Command Response 1 */
  uint32_t cmdrsp2;              /* Command Response 2 */
  uint32_t cmdrsp3;              /* Command Response 3 */
  uint32_t dbap;                 /* Data buffer access port */
  uint32_t prsstat;              /* Present State Register */
  uint32_t proctl;               /* Protocol Control Register */
  uint32_t sysctl;               /* System Control Register */
  uint32_t irqstat;              /* Interrupt Status Register */
  uint32_t irqstaten;            /* Interrupt Status Enable Register */
  uint32_t irqsigen;             /* Interrupt Signal Enable Register */
  uint32_t ac12err;              /* Auto CMD12 Error Status Register */
  uint32_t htcapblt;             /* Host Controller Capabilities */
  uint32_t wml;                  /* Watermark Level Register */
  uint32_t mixctrl;              /* Mixer Control */
  uint32_t fevent;               /* Force Event */
  uint32_t admaes;               /* ADMA Error Status Register */
  uint32_t adsaddr;              /* ADMA System Address Register */
  uint32_t dllctrl;              /* Delay line control */
  uint32_t dllstat;              /* Delay line status */
  uint32_t clktune;              /* Clock tune and control */
  uint32_t vendor;               /* Vendor Specific Register */
  uint32_t mmcboot;              /* MMC Boot Register */
  uint32_t vendor2;              /* Vendor Specific Register 2 */
  uint32_t tuningctrl;           /* Tuning Control */
};
#endif

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* Low-level helpers ********************************************************/

static void imxrt_configwaitints(struct imxrt_dev_s *priv, uint32_t waitints,
              sdio_eventset_t waitevents, sdio_eventset_t wkupevents);
static void imxrt_configxfrints(struct imxrt_dev_s *priv, uint32_t xfrints);

/* DMA Helpers **************************************************************/

#ifdef CONFIG_SDIO_XFRDEBUG
static void imxrt_sampleinit(void);
static void imxrt_sdhcsample(struct imxrt_sdhcregs_s *regs);
static void imxrt_sample(struct imxrt_dev_s *priv, int index);
static void imxrt_dumpsample(struct imxrt_dev_s *priv,
              struct imxrt_sdhcregs_s *regs, const char *msg);
static void imxrt_dumpsamples(struct imxrt_dev_s *priv);
static void imxrt_showregs(struct imxrt_dev_s *priv, const char *msg);

#else
#  define   imxrt_sampleinit()
#  define   imxrt_sample(priv, index)
#  define   imxrt_dumpsamples(priv)
#  define   imxrt_showregs(priv, msg)
#endif

/* Data Transfer Helpers ****************************************************/

static void imxrt_dataconfig(struct imxrt_dev_s *priv, bool bwrite,
              unsigned int datalen, unsigned int timeout);

#ifndef CONFIG_IMXRT_USDHC_DMA
static void imxrt_transmit(struct imxrt_dev_s *priv);
static void imxrt_receive(struct imxrt_dev_s *priv);
#if defined(CONFIG_ARMV7M_DCACHE)
static void imxrt_recvdma(struct imxrt_dev_s *priv);
#endif
#endif

static void imxrt_eventtimeout(wdparm_t arg);
static void imxrt_endwait(struct imxrt_dev_s *priv,
              sdio_eventset_t wkupevent);
static void imxrt_endtransfer(struct imxrt_dev_s *priv,
              sdio_eventset_t wkupevent);

/* Interrupt Handling *******************************************************/

static int  imxrt_interrupt(int irq, void *context, void *arg);

/* SDIO interface methods ***************************************************/

/* Mutual exclusion */

#ifdef CONFIG_SDIO_MUXBUS
static int imxrt_lock(struct sdio_dev_s *dev, bool lock);
#endif

/* Initialization/setup */

static void imxrt_reset(struct sdio_dev_s *dev);
static sdio_capset_t imxrt_capabilities(struct sdio_dev_s *dev);
static sdio_statset_t imxrt_status(struct sdio_dev_s *dev);
static void imxrt_widebus(struct sdio_dev_s *dev, bool enable);

#ifdef CONFIG_IMXRT_USDHC_ABSFREQ
static void imxrt_frequency(struct sdio_dev_s *dev, uint32_t frequency);
#endif

static void imxrt_clock(struct sdio_dev_s *dev, enum sdio_clock_e rate);
static int  imxrt_attach(struct sdio_dev_s *dev);

/* Command/Status/Data Transfer */

static int  imxrt_sendcmd(struct sdio_dev_s *dev, uint32_t cmd,
              uint32_t arg);

#ifdef CONFIG_SDIO_BLOCKSETUP
static void imxrt_blocksetup(struct sdio_dev_s *dev,
              unsigned int blocklen, unsigned int nblocks);
#endif

#ifndef CONFIG_IMXRT_USDHC_DMA
static int  imxrt_recvsetup(struct sdio_dev_s *dev, uint8_t *buffer,
              size_t nbytes);
static int  imxrt_sendsetup(struct sdio_dev_s *dev,
              const uint8_t *buffer, size_t nbytes);
#endif

static int  imxrt_cancel(struct sdio_dev_s *dev);
static int  imxrt_waitresponse(struct sdio_dev_s *dev, uint32_t cmd);
static int  imxrt_recvshortcrc(struct sdio_dev_s *dev, uint32_t cmd,
              uint32_t *rshort);
static int  imxrt_recvlong(struct sdio_dev_s *dev, uint32_t cmd,
              uint32_t rlong[4]);
static int  imxrt_recvshort(struct sdio_dev_s *dev, uint32_t cmd,
              uint32_t *rshort);

/* EVENT handler */

static void imxrt_waitenable(struct sdio_dev_s *dev,
              sdio_eventset_t eventset, uint32_t timeout);
static sdio_eventset_t imxrt_eventwait(struct sdio_dev_s *dev);
static void imxrt_callbackenable(struct sdio_dev_s *dev,
              sdio_eventset_t eventset);
static int  imxrt_registercallback(struct sdio_dev_s *dev,
              worker_t callback, void *arg);

/* DMA */

#ifdef CONFIG_IMXRT_USDHC_DMA
#  if defined(CONFIG_ARCH_HAVE_SDIO_PREFLIGHT)
static int  imxrt_dmapreflight(struct sdio_dev_s *dev,
                               const uint8_t *buffer, size_t buflen);
#  endif
static int  imxrt_dmarecvsetup(struct sdio_dev_s *dev,
              uint8_t *buffer, size_t buflen);
static int  imxrt_dmasendsetup(struct sdio_dev_s *dev,
              const uint8_t *buffer, size_t buflen);
#endif

/* Initialization/uninitialization/reset ************************************/

static void imxrt_callback(void *arg);

/****************************************************************************
 * Private Data
 ****************************************************************************/

struct imxrt_dev_s g_sdhcdev[IMXRT_MAX_SDHC_DEV_SLOTS] =
{
#ifdef CONFIG_IMXRT_USDHC1
  {
    .addr               = IMXRT_USDHC1_BASE,
#if defined(PIN_USDHC1_CD_GPIO)
    .sw_cd_gpio         = PIN_USDHC1_CD_GPIO,
#endif
#if defined(CONFIG_IMXRT_USDHC1_INVERT_CD)
    .cd_invert         = true,
#endif
    .dev                =
    {
#ifdef CONFIG_SDIO_MUXBUS
      .lock             = imxrt_lock,
#endif
      .reset            = imxrt_reset,
      .capabilities     = imxrt_capabilities,
      .status           = imxrt_status,
      .widebus          = imxrt_widebus,
      .clock            = imxrt_clock,
      .attach           = imxrt_attach,
      .sendcmd          = imxrt_sendcmd,
#ifdef CONFIG_SDIO_BLOCKSETUP
      .blocksetup       = imxrt_blocksetup,
#endif

#ifndef CONFIG_IMXRT_USDHC_DMA
      .recvsetup        = imxrt_recvsetup,
      .sendsetup        = imxrt_sendsetup,
#else
      .recvsetup        = imxrt_dmarecvsetup,
      .sendsetup        = imxrt_dmasendsetup,
#endif
      .cancel           = imxrt_cancel,
      .waitresponse     = imxrt_waitresponse,
      .recv_r1          = imxrt_recvshortcrc,
      .recv_r2          = imxrt_recvlong,
      .recv_r3          = imxrt_recvshort,
      .recv_r4          = imxrt_recvshort,
      .recv_r5          = imxrt_recvshortcrc,
      .recv_r6          = imxrt_recvshortcrc,
      .recv_r7          = imxrt_recvshort,
      .waitenable       = imxrt_waitenable,
      .eventwait        = imxrt_eventwait,
      .callbackenable   = imxrt_callbackenable,
      .registercallback = imxrt_registercallback,
#ifdef CONFIG_SDIO_DMA
#ifdef CONFIG_IMXRT_USDHC_DMA
#  if defined(CONFIG_ARCH_HAVE_SDIO_PREFLIGHT)
      .dmapreflight     = imxrt_dmapreflight,
#  endif
      .dmarecvsetup     = imxrt_dmarecvsetup,
      .dmasendsetup     = imxrt_dmasendsetup,
#else
      .dmarecvsetup     = imxrt_recvsetup,
      .dmasendsetup     = imxrt_sendsetup,
#endif
#endif
    },
    .waitsem = SEM_INITIALIZER(0),
  },
#endif

#ifdef CONFIG_IMXRT_USDHC2
  {
    .addr               = IMXRT_USDHC2_BASE,
#if defined(PIN_USDHC2_CD_GPIO)
    .sw_cd_gpio         = PIN_USDHC2_CD_GPIO,
#endif
#if defined(CONFIG_IMXRT_USDHC2_INVERT_CD)
    .cd_invert         = true,
#endif
    .dev                =
    {
#ifdef CONFIG_SDIO_MUXBUS
      .lock             = imxrt_lock,
#endif
      .reset            = imxrt_reset,
      .capabilities     = imxrt_capabilities,
      .status           = imxrt_status,
      .widebus          = imxrt_widebus,
      .clock            = imxrt_clock,
      .attach           = imxrt_attach,
      .sendcmd          = imxrt_sendcmd,
#ifdef CONFIG_SDIO_BLOCKSETUP
      .blocksetup       = imxrt_blocksetup,
#endif

#ifndef CONFIG_IMXRT_USDHC_DMA
      .recvsetup        = imxrt_recvsetup,
      .sendsetup        = imxrt_sendsetup,
#else
      .recvsetup        = imxrt_dmarecvsetup,
      .sendsetup        = imxrt_dmasendsetup,
#endif
      .cancel           = imxrt_cancel,
      .waitresponse     = imxrt_waitresponse,
      .recv_r1          = imxrt_recvshortcrc,
      .recv_r2          = imxrt_recvlong,
      .recv_r3          = imxrt_recvshort,
      .recv_r4          = imxrt_recvshort,
      .recv_r5          = imxrt_recvshortcrc,
      .recv_r6          = imxrt_recvshortcrc,
      .recv_r7          = imxrt_recvshort,
      .waitenable       = imxrt_waitenable,
      .eventwait        = imxrt_eventwait,
      .callbackenable   = imxrt_callbackenable,
      .registercallback = imxrt_registercallback,
#ifdef CONFIG_SDIO_DMA
#  if defined(CONFIG_ARCH_HAVE_SDIO_PREFLIGHT)
      .dmapreflight     = imxrt_dmapreflight,
#  endif
#ifdef CONFIG_IMXRT_USDHC_DMA
      .dmarecvsetup     = imxrt_dmarecvsetup,
      .dmasendsetup     = imxrt_dmasendsetup,
#else
      .dmarecvsetup     = imxrt_recvsetup,
      .dmasendsetup     = imxrt_sendsetup,
#endif
    },
    .waitsem = SEM_INITIALIZER(0),
  }
#endif
#endif
};

#ifdef CONFIG_SDIO_XFRDEBUG
/* Register logging support */

static struct imxrt_sdhcregs_s g_sampleregs[DEBUG_NSAMPLES];
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: imxrt_configwaitints
 *
 * Description:
 *   Enable/disable SDIO interrupts needed to support the wait function
 *
 * Input Parameters:
 *   priv       - A reference to the SDIO device state structure
 *   waitints   - The set of bits in the SDIO MASK register to set
 *   waitevents - Waited for events
 *   wkupevent  - Wake-up events
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void imxrt_configwaitints(struct imxrt_dev_s *priv, uint32_t waitints,
                                 sdio_eventset_t waitevents,
                                 sdio_eventset_t wkupevent)
{
  irqstate_t flags;

  /* Save all of the data and set the new interrupt mask in one, atomic
   * operation.
   */

  flags            = enter_critical_section();
  priv->waitevents = waitevents;
  priv->wkupevent  = wkupevent;
  priv->waitints   = waitints;

#ifdef CONFIG_IMXRT_USDHC_DMA
  priv->xfrflags   = 0;
#endif
  putreg32(priv->xfrints | priv->waitints | priv->cintints,
           priv->addr + IMXRT_USDHC_IRQSIGEN_OFFSET);
  leave_critical_section(flags);
}

/****************************************************************************
 * Name: imxrt_configxfrints
 *
 * Description:
 *   Enable SDIO interrupts needed to support the data transfer event
 *
 * Input Parameters:
 *   priv    - A reference to the SDIO device state structure
 *   xfrints - The set of bits in the SDIO MASK register to set
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void imxrt_configxfrints(struct imxrt_dev_s *priv, uint32_t xfrints)
{
  irqstate_t flags;

  flags = enter_critical_section();
  priv->xfrints = xfrints;
  putreg32(priv->xfrints | priv->waitints | priv->cintints,
           priv->addr + IMXRT_USDHC_IRQSIGEN_OFFSET);
  leave_critical_section(flags);
}

/****************************************************************************
 * Name: imxrt_sampleinit
 *
 * Description:
 *   Setup prior to collecting DMA samples
 *
 ****************************************************************************/

#ifdef CONFIG_SDIO_XFRDEBUG
static void imxrt_sampleinit(void)
{
  memset(g_sampleregs, 0xff,
         DEBUG_NSAMPLES * sizeof(struct imxrt_sdhcregs_s));
}
#endif

/****************************************************************************
 * Name: imxrt_sdhcsample
 *
 * Description:
 *   Sample SDIO registers
 *
 ****************************************************************************/

#ifdef CONFIG_SDIO_XFRDEBUG
static void imxrt_sdhcsample(struct imxrt_sdhcregs_s *regs)
{
  regs->dsaddr    = getreg32(DBG_BASE_ADDR + IMXRT_USDHC_DSADDRL_OFFSET);
  regs->blkattr   = getreg32(DBG_BASE_ADDR + IMXRT_USDHC_BLKATTRL_OFFSET);
  regs->cmdarg    = getreg32(DBG_BASE_ADDR + IMXRT_USDHC_CMDARGL_OFFSET);
  regs->xferty    = getreg32(DBG_BASE_ADDR + IMXRT_USDHC_XFERTYPL_OFFSET);
  regs->cmdrsp0   = getreg32(DBG_BASE_ADDR + IMXRT_USDHC_CMDRSP0L_OFFSET);
  regs->cmdrsp1   = getreg32(DBG_BASE_ADDR + IMXRT_USDHC_CMDRSP1L_OFFSET);
  regs->cmdrsp2   = getreg32(DBG_BASE_ADDR + IMXRT_USDHC_CMDRSP2L_OFFSET);
  regs->cmdrsp3   = getreg32(DBG_BASE_ADDR + IMXRT_USDHC_CMDRSP3L_OFFSET);
  regs->prsstat   = getreg32(DBG_BASE_ADDR + IMXRT_USDHC_PRSSTATL_OFFSET);
  regs->proctl    = getreg32(DBG_BASE_ADDR + IMXRT_USDHC_PROCTLL_OFFSET);
  regs->sysctl    = getreg32(DBG_BASE_ADDR + IMXRT_USDHC_SYSCTLL_OFFSET);
  regs->irqstat   = getreg32(DBG_BASE_ADDR + IMXRT_USDHC_IRQSTATL_OFFSET);
  regs->irqstaten = getreg32(DBG_BASE_ADDR + IMXRT_USDHC_IRQSTATENL_OFFSET);
  regs->irqsigen  = getreg32(DBG_BASE_ADDR + IMXRT_USDHC_IRQSIGENL_OFFSET);
  regs->ac12err   = getreg32(DBG_BASE_ADDR + IMXRT_USDHC_AC12ERRL_OFFSET);
  regs->htcapblt  = getreg32(DBG_BASE_ADDR + IMXRT_USDHC_HTCAPBLTL_OFFSET);
  regs->wml       = getreg32(DBG_BASE_ADDR + IMXRT_USDHC_WMLL_OFFSET);
  regs->admaes    = getreg32(DBG_BASE_ADDR + IMXRT_USDHC_ADMAESL_OFFSET);
  regs->adsaddr   = getreg32(DBG_BASE_ADDR + IMXRT_USDHC_ADSADDRL_OFFSET);
  regs->vendor    = getreg32(DBG_BASE_ADDR + IMXRT_USDHC_VENDORL_OFFSET);
  regs->mmcboot   = getreg32(DBG_BASE_ADDR + IMXRT_USDHC_MMCBOOTL_OFFSET);
}
#endif

/****************************************************************************
 * Name: imxrt_sample
 *
 * Description:
 *   Sample SDIO/DMA registers
 *
 ****************************************************************************/

#ifdef CONFIG_SDIO_XFRDEBUG
static void imxrt_sample(struct imxrt_dev_s *priv, int index)
{
  if (priv->addr == DBG_BASE_ADDR)
    {
      imxrt_sdhcsample(&g_sampleregs[index]);
    }
}
#endif

/****************************************************************************
 * Name: imxrt_dumpsample
 *
 * Description:
 *   Dump one register sample
 *
 ****************************************************************************/

#ifdef CONFIG_SDIO_XFRDEBUG
static void imxrt_dumpsample(struct imxrt_dev_s *priv,
                             struct imxrt_sdhcregs_s *regs, const char *msg)
{
  mcinfo("USDHC Registers: %s\n", msg);
  mcinfo("   DSADDR[%08x]: %08x\n",
         IMXRT_USDHC_DSADDR_OFFSET, regs->dsaddr);
  mcinfo("  BLKATTR[%08x]: %08x\n",
         IMXRT_USDHC_BLKATTR_OFFSET, regs->blkattr);
  mcinfo("   CMDARG[%08x]: %08x\n",
         IMXRT_USDHC_CMDARG_OFFSET, regs->cmdarg);
  mcinfo("   XFERTY[%08x]: %08x\n",
         IMXRT_USDHC_XFERTYP_OFFSET, regs->xferty);
  mcinfo("  CMDRSP0[%08x]: %08x\n",
         IMXRT_USDHC_CMDRSP0_OFFSET, regs->cmdrsp0);
  mcinfo("  CMDRSP1[%08x]: %08x\n",
         IMXRT_USDHC_CMDRSP1_OFFSET, regs->cmdrsp1);
  mcinfo("  CMDRSP2[%08x]: %08x\n",
         IMXRT_USDHC_CMDRSP2_OFFSET, regs->cmdrsp2);
  mcinfo("  CMDRSP3[%08x]: %08x\n",
         IMXRT_USDHC_CMDRSP3_OFFSET, regs->cmdrsp3);
  mcinfo("  PRSSTAT[%08x]: %08x\n",
         IMXRT_USDHC_PRSSTAT_OFFSET, regs->prsstat);
  mcinfo("   PROCTL[%08x]: %08x\n",
         IMXRT_USDHC_PROCTL_OFFSET, regs->proctl);
  mcinfo("   SYSCTL[%08x]: %08x\n",
         IMXRT_USDHC_SYSCTL_OFFSET, regs->sysctl);
  mcinfo("  IRQSTAT[%08x]: %08x\n",
         IMXRT_USDHC_IRQSTAT_OFFSET, regs->irqstat);
  mcinfo("IRQSTATEN[%08x]: %08x\n",
         IMXRT_USDHC_IRQSTATEN_OFFSET, regs->irqstaten);
  mcinfo(" IRQSIGEN[%08x]: %08x\n",
         IMXRT_USDHC_IRQSIGEN_OFFSET, regs->irqsigen);
  mcinfo("  AC12ERR[%08x]: %08x\n",
         IMXRT_USDHC_AC12ERR_OFFSET, regs->ac12err);
  mcinfo(" HTCAPBLT[%08x]: %08x\n",
         IMXRT_USDHC_HTCAPBLT_OFFSET, regs->htcapblt);
  mcinfo("      WML[%08x]: %08x\n",
         IMXRT_USDHC_WML_OFFSET, regs->wml);
  mcinfo("   ADMAES[%08x]: %08x\n",
         IMXRT_USDHC_ADMAES_OFFSET, regs->admaes);
  mcinfo("  ADSADDR[%08x]: %08x\n",
         IMXRT_USDHC_ADSADDR_OFFSET, regs->adsaddr);
  mcinfo("   VENDOR[%08x]: %08x\n",
         IMXRT_USDHC_VENDOR_OFFSET, regs->vendor);
  mcinfo("  MMCBOOT[%08x]: %08x\n",
         IMXRT_USDHC_MMCBOOT_OFFSET, regs->mmcboot);
}
#endif

/****************************************************************************
 * Name: imxrt_dumpsamples
 *
 * Description:
 *   Dump all sampled register data
 *
 ****************************************************************************/

#ifdef CONFIG_SDIO_XFRDEBUG
static void imxrt_dumpsamples(struct imxrt_dev_s *priv)
{
  imxrt_dumpsample(priv, &g_sampleregs[SAMPLENDX_BEFORE_SETUP],
                   "Before setup");
  imxrt_dumpsample(priv, &g_sampleregs[SAMPLENDX_AFTER_SETUP],
                   "After setup");
  imxrt_dumpsample(priv, &g_sampleregs[SAMPLENDX_END_TRANSFER],
                   "End of transfer");
}
#endif

/****************************************************************************
 * Name: imxrt_showregs
 *
 * Description:
 *   Dump the current state of all registers
 *
 ****************************************************************************/

#ifdef CONFIG_SDIO_XFRDEBUG
static void imxrt_showregs(struct imxrt_dev_s *priv, const char *msg)
{
  struct imxrt_sdhcregs_s regs;

  imxrt_sdhcsample(&regs);
  imxrt_dumpsample(priv, &regs, msg);
}
#endif

/****************************************************************************
 * Data Transfer Helpers
 ****************************************************************************/

/****************************************************************************
 * Name: imxrt_dataconfig
 *
 * Description:
 *   Configure the SDIO data path for the next data transfer
 *
 ****************************************************************************/

static void imxrt_dataconfig(struct imxrt_dev_s *priv, bool bwrite,
                             unsigned int datalen, unsigned int timeout)
{
  unsigned int watermark;
  uint32_t regval = 0;

  /* Set the data timeout value in the USDHC_SYSCTL field to the selected
   * value.
   */

  regval  = getreg32(priv->addr + IMXRT_USDHC_SYSCTL_OFFSET);
  regval &= ~USDHC_SYSCTL_DTOCV_MASK;
  regval |= timeout << USDHC_SYSCTL_DTOCV_SHIFT;
  putreg32(regval, priv->addr + IMXRT_USDHC_SYSCTL_OFFSET);

