apache/nuttx/arch/arm/src/imxrt/imxrt_usdhc.c
  /* Save the source buffer information for use by the interrupt handler */

#if defined(CONFIG_ARMV7M_DCACHE)
  priv->unaligned_rx = false;

  /* Flush cache to physical memory when not in DTCM memory */

#  if !defined(CONFIG_ARMV7M_DCACHE_WRITETHROUGH)
    {
      up_clean_dcache((uintptr_t)buffer, (uintptr_t)buffer + buflen);
    }

#  endif
#endif
  priv->buffer    = (uint32_t *)buffer;
  priv->remaining = buflen;

  /* Then set up the SDIO data path */

  imxrt_dataconfig(priv, true, buflen, USDHC_DTOCV_MAXTIMEOUT);

  /* Configure the TX DMA */

  putreg32((uint32_t) buffer, priv->addr + IMXRT_USDHC_DSADDR_OFFSET);

  /* Sample the register state */

  imxrt_sample(priv, SAMPLENDX_AFTER_SETUP);

  /* Enable TX interrupts */

  imxrt_configxfrints(priv, USDHC_DMADONE_INTS);
  return OK;
}
#endif

/****************************************************************************
 * Name: imxrt_callback
 *
 *  Description:
 *   Perform callback.
 *
 * Assumptions:
 *   This function does not execute in the context of an interrupt handler.
 *   It may be invoked on any user thread or scheduled on the work thread
 *   from an interrupt handler.
 *
 ****************************************************************************/

static void imxrt_callback(void *arg)
{
  struct imxrt_dev_s *priv = (struct imxrt_dev_s *)arg;

  /* Is a callback registered? */

  DEBUGASSERT(priv != NULL);
  mcinfo("Callback %p(%p) cbevents: %02x cdstatus: %02x\n", priv->callback,
         priv->cbarg, priv->cbevents, priv->cdstatus);

  if (priv->callback)
    {
      /* Yes.. Check for enabled callback events */

      if ((priv->cdstatus & SDIO_STATUS_PRESENT) != 0)
        {
          /* Media is present.  Is the media inserted event enabled? */

          if ((priv->cbevents & SDIOMEDIA_INSERTED) == 0)
            {
              /* No... return without performing the callback */

              return;
            }
        }
      else
        {
          /* Media is not present.  Is the media eject event enabled? */

          if ((priv->cbevents & SDIOMEDIA_EJECTED) == 0)
            {
              /* No... return without performing the callback */

              return;
            }
        }

      /* Perform the callback, disabling further callbacks.  Of course, the
       * the callback can (and probably should) re-enable callbacks.
       */

      priv->cbevents = 0;

      /* Callbacks cannot be performed in the context of an interrupt
       * handler.  If we are in an interrupt handler, then queue the
       * callback to be performed later on the work thread.
       */

      if (up_interrupt_context())
        {
          /* Yes.. queue it */

          mcinfo("Queuing callback to %p(%p)\n",
                 priv->callback, priv->cbarg);

          work_queue(HPWORK, &priv->cbwork, priv->callback,
                     priv->cbarg, 0);
        }
      else
        {
          /* No.. then just call the callback here */

          mcinfo("Callback to %p(%p)\n",
                 priv->callback, priv->cbarg);

          priv->callback(priv->cbarg);
        }
    }
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: imxrt_usdhc_set_sdio_card_isr
 *
 * Description:
 *   SDIO card generates interrupt via SDIO_DATA_1 pin.
 *   Called by board-specific logic to register an ISR for SDIO card.
 *
 * Input Parameters:
 *   func  - callback function.
 *   arg   - arg to be passed to the function.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

void imxrt_usdhc_set_sdio_card_isr(struct sdio_dev_s *dev,
                                   int (*func)(void *), void *arg)
{
  irqstate_t flags;
  uint32_t regval;
  struct imxrt_dev_s *priv = (struct imxrt_dev_s *)dev;

  priv->do_sdio_card = func;
  priv->do_sdio_arg = arg;

  if (priv->do_sdio_card != NULL)
    {
      priv->cintints = USDHC_INT_CINT;
    }
  else
    {
      priv->cintints = 0;
    }

#if defined(CONFIG_MMCSD_HAVE_CARDDETECT)
  if (priv->sw_cd_gpio == 0)
    {
      priv->cintints |= USDHC_INT_CINS | USDHC_INT_CRM;
    }
#endif

  flags  = enter_critical_section();
  regval = getreg32(priv->addr + IMXRT_USDHC_IRQSIGEN_OFFSET);
  regval = (regval & ~USDHC_INT_CINT) | priv->cintints;
  putreg32(regval, priv->addr + IMXRT_USDHC_IRQSIGEN_OFFSET);
  leave_critical_section(flags);
}

/****************************************************************************
 * Name: imxrt_sdhc_initialize
 *
 * Description:
 *   Initialize SDIO for operation.
 *
 * Input Parameters:
 *   slotno - Slot to be used
 *
 * Returned Value:
 *   A reference to an SDIO interface structure.
 *   NULL is returned on failures.
 *
 ****************************************************************************/

struct sdio_dev_s *imxrt_usdhc_initialize(int slotno)
{
  DEBUGASSERT(slotno < IMXRT_MAX_SDHC_DEV_SLOTS);
  struct imxrt_dev_s *priv = &g_sdhcdev[slotno];

  /* Initialize the USDHC slot structure data structure */

  switch (priv->addr)
    {
    case IMXRT_USDHC1_BASE:
      /* Configure pins for 1 or 4-bit, wide-bus operation (the chip is
       * capable of 8-bit wide bus operation but D4-D7 are not configured).
       * If bus is multiplexed then there is a custom bus configuration
       * utility in the scope of the board support package.
       */

#ifndef CONFIG_SDIO_MUXBUS
#if defined(CONFIG_IMXRT_USDHC1_WIDTH_D1_D4)
      imxrt_config_gpio(PIN_USDHC1_D1);
      imxrt_config_gpio(PIN_USDHC1_D2);
      imxrt_config_gpio(PIN_USDHC1_D3);
#endif
      /* Clocking and CMD pins (all data widths) */

      imxrt_config_gpio(PIN_USDHC1_D0);
      imxrt_config_gpio(PIN_USDHC1_DCLK);
      imxrt_config_gpio(PIN_USDHC1_CMD);
#endif

#if defined(CONFIG_MMCSD_HAVE_CARDDETECT)
#  if defined(PIN_USDHC1_CD)
      imxrt_config_gpio(PIN_USDHC1_CD);
#  else
      if (priv->sw_cd_gpio != 0)
        {
          imxrt_config_gpio(priv->sw_cd_gpio);
        }
#  endif
#endif

      imxrt_clockall_usdhc1();
      break;

#if defined(CONFIG_IMXRT_USDHC2)
    case IMXRT_USDHC2_BASE:
      imxrt_config_gpio(PIN_USDHC2_D0);
      imxrt_config_gpio(PIN_USDHC2_DCLK);
      imxrt_config_gpio(PIN_USDHC2_CMD);

#  if defined(CONFIG_IMXRT_USDHC2_WIDTH_D1_D4) || defined(CONFIG_IMXRT_USDHC2_WIDTH_D1_D8)
      imxrt_config_gpio(PIN_USDHC2_D1);
      imxrt_config_gpio(PIN_USDHC2_D2);
      imxrt_config_gpio(PIN_USDHC2_D3);
#  endif

#  if defined(CONFIG_IMXRT_USDHC2_WIDTH_D1_D8)
      imxrt_config_gpio(PIN_USDHC2_D4);
      imxrt_config_gpio(PIN_USDHC2_D5);
      imxrt_config_gpio(PIN_USDHC2_D6);
      imxrt_config_gpio(PIN_USDHC2_D7);
#  endif

#  if defined(CONFIG_MMCSD_HAVE_CARDDETECT)
#    if defined(PIN_USDHC2_CD)
      imxrt_config_gpio(PIN_USDHC2_CD);
#    else
      if (priv->sw_cd_gpio != 0)
        {
          imxrt_config_gpio(priv->sw_cd_gpio);
        }
#    endif
#  endif

      imxrt_clockall_usdhc2();
      break;
#endif
    default:
      return NULL;
    }

  imxrt_reset(&priv->dev);
  imxrt_showregs(priv, "After reset");

  return &g_sdhcdev[slotno].dev;
}

#endif /* CONFIG_IMXRT_USDHC */
